"use client"
import Image from "next/image"
import mine1 from "../../../public/img/mine1.jpg"
import mine2 from "../../../public/img/mine2.jpg"
import mine3 from "../../../public/img/mine3.jpg"
import mine4 from "../../../public/img/mine4.jpg"
import mine5 from "../../../public/img/mine5.jpg"
import mine6 from "../../../public/img/mine6.jpg"

export default function Mine() {
    return(
        <div className="mt-9 ml-33.75 flex gap-10.25 relative mb-17.25">
            <div className="w-172.75 h-fit border border-white rounded-[1.1875rem] p-10 pt-7.5">
                <h1 className="font-bold text-4xl mb-4">АО «Васильевский рудник»</h1>
                <div className="w-100% h-fit flex gap-4 flex-col">
                    <p className="mine-p">Автономная система канализации эффективно и главное незаметно для проживающих и окружающих, выполняет свой прямой функционал и обеспечивает высокое качество очистки стоков.</p>
                    <p className="mine-p"><b>Устаревшие варианты</b> септиков из колец, выгребные ямы и заглубленных в грунт перфорированные емкости — все эти версии канализации в частном доме достаточно серьезно вредят окружающей среде и загрязняют опасными биологическими включениями подземные воды.</p>
                    <p className="mine-p"><b>Автономная канализация</b> частного дома полностью нивелирует вышеперечисленные риски навредить окружающей среде. Проходящие многоступенчатую систему очистки стоки на выходе из установки полностью соответствуют нормативам для сброса в грунт или фильтрующие колодцы.</p>
                    <h3 className="mine-h3">Почему клиенты выбирают ЛОС:</h3>
                    <ol className="mine-ol">
                        <li className="mine-li">Срок службы <pre> </pre> <b>50 лет</b></li>
                        <li className="mine-li">Монтаж <pre> </pre><b>за 1 день</b></li>
                        <li className="mine-li">Производительность<pre> </pre><b>до 15 человек</b></li>
                        <li className="mine-li">Устойчивость<pre> </pre><b>к залповым сбросам</b></li>
                        <li className="mine-li"><b>Отказ</b><pre> </pre>от ассенизационной машины</li>
                        <li className="mine-li">Работает<pre> </pre><b>при отключенной электроэнергии</b></li>
                    </ol>
                    <h3 className="mine-h3">Также лос выбирают за:</h3>
                    <div className="flex w-132 h-fit gap-2.5">
                    <p className="mine-point">1</p>
                    <p className="mine-p w-123.5"><b>ЭКОНОМИЧНОСТЬ</b><br />
Приобретая станцию у производителя, вы добьетесь максимальной экономии</p>
                    </div>
                    <div className="flex w-132 h-fit gap-2.5">
                    <p className="mine-point">2</p>
                    <p className="mine-p w-123.5"><b>ЭКОЛОГИЧНОСТЬ</b><br />
Стоки, прошедшие через установку, полностью безопасны для окружающей среды</p>
                    </div>
                    <div className="flex w-132 h-fit gap-2.5">
                    <p className="mine-point">3</p>
                    <p className="mine-p w-123.5"><b>ДОЛГОВЕЧНОСТЬ</b><br />
Стеклопластиковый корпус прослужит не менее 50 лет</p>
                    </div>
                    <div className="flex w-132 h-fit gap-2.5">
                    <p className="mine-point">4</p>
                    <p className="mine-p w-123.5"><b>АВТОНОМНОСТЬ</b><br />
Вам не нужно вмешиваться в работу станции - она работает сама.</p>
                    </div>
                    <div className="flex w-132 h-fit gap-2.5">
                    <p className="mine-point">5</p>
                    <p className="mine-p w-123.5"><b>ПРОСТОТА УСТАНОВКИ</b><br />
Монтаж за 1 день, без значительных земляных работ</p>
                    </div>
                    <div className="flex w-132 h-fit gap-2.5">
                    <p className="mine-point">6</p>
                    <p className="mine-p w-123.5"><b>НАДЕЖНОСТЬ</b><br />
Смолы импортных производителей — залог нашей надежности</p>
                    </div>
                </div>
            </div>
            <div className="w-fit h-fit flex flex-col gap-px">
                <Image src={mine1} alt='img1' width={433} height={300} className="w-108.25 h-75 rounded-t-[0.625rem]"/>
                <div className="w-fit h-fit flex gap-px">
                <Image src={mine2} alt='img2' width={86} height={64} className="w-21.5 h-16"/>
                <Image src={mine3} alt='img3' width={86} height={64} className="w-21.5 h-16"/>
                <Image src={mine4} alt='img4' width={86} height={64} className="w-21.5 h-16"/>
                <Image src={mine5} alt='img5' width={86} height={64} className="w-21.5 h-16"/>
                <Image src={mine6} alt='img6' width={86} height={64} className="w-21.5 h-16"/>
                </div>
            </div>
            <svg
        width="833"
        height="1075"
        viewBox="0 0 833 1075"
        fill="none"
        xmlns="http://www.w3.org/2000/svg"
		  className='absolute top-15 left-90 -z-10 w-208.25 h-268.75 opacity-10'
      >
        <path
          d="M108.987 33.252H218.886V0H219.886V33.252H329.784V0H330.784V33.252H440.683V0H441.683V33.252H551.581V0H552.581V33.252H662.479V0.000976562H663.479V33.252H773.377V0H774.377V33.252H884.275V0H885.275V33.252H992.058V34.252H885.275V144.15H992.058V145.15H885.275V255.05H992.058V256.05H885.275V365.947H992.058V366.947H885.275V476.845H992.058V477.845H885.275V596.183H992.058V597.183H885.275V707.08H992.058V708.08H885.275V817.5H992V818.5H885.275V928.5H992V929.5H885.275V1039.78H992.058V1040.78H885.275V1074.03H884.275V1040.78H774.377V1074.03H773.377V1040.78H108.987V1074.03H107.987V1040.78H0V1039.78H107.987V708.08H0V707.08H107.987V597.183H0V596.183H107.987V477.845H0V476.845H107.987V366.947H0V365.947H107.987V256.05H0V255.05H107.987V145.15H0V144.15H107.987V34.252H0V33.252H107.987V0H108.987V33.252ZM108.987 1039.78H773.377V929.5H733V928.5H773.377V818.5H754V817.5H773.377V708.08H663.5V759H662.5V708.08H552.5V743H551.5V708.08H441.5V753H440.5V708.08H330.5V750H329.5V708.08H219.5V738H218.5V708.08H108.987V1039.78ZM774.377 1039.78H884.275V929.5H774.377V1039.78ZM774.5 850H774.377V928.5H884.275V818.5H774.5V850ZM774.5 817.5H884.275V708.08H774.5V817.5ZM108.987 707.08H218.5V597.183H108.987V707.08ZM219.5 707.08H329.5V597.183H219.5V707.08ZM330.5 707.08H440.5V597.183H330.5V707.08ZM441.5 707.08H551.5V597.183H441.5V707.08ZM552.5 707.08H662.5V597.183H552.5V707.08ZM663.5 707.08H773.377V597.183H663.5V707.08ZM774.5 707.08H884.275V597.183H774.5V707.08ZM108.987 596.183H218.5V550H219.5V596.183H329.5V550H330.5V596.183H440.5V550H441.5V596.183H551.5V550H552.5V596.183H662.5V551H663.5V596.183H773.377V562.931H773.5V550H774.5V596.183H884.275V477.845H774.377V549.67H773.377V477.845H663.479V548.465H662.479V477.845H552.581V549.67H551.581V477.845H441.683V549.67H440.683V477.845H330.784V549.67H329.784V477.845H219.886V549.67H218.886V477.845H108.987V596.183ZM108.987 476.845H218.886V366.947H108.987V476.845ZM219.886 476.845H329.784V366.947H219.886V476.845ZM330.784 476.845H440.683V366.947H330.784V476.845ZM441.683 476.845H551.581V366.947H441.683V476.845ZM552.581 476.845H662.479V366.947H552.581V476.845ZM663.479 476.845H773.377V366.947H663.479V476.845ZM774.377 476.845H884.275V366.947H774.377V476.845ZM108.987 365.947H218.886V256.05H108.987V365.947ZM219.886 365.947H329.784V256.05H219.886V365.947ZM330.784 365.947H440.683V256.05H330.784V365.947ZM441.683 365.947H551.581V256.05H441.683V365.947ZM552.581 365.947H662.479V256.05H552.581V365.947ZM663.479 365.947H773.377V256.05H663.479V365.947ZM774.377 365.947H884.275V256.05H774.377V365.947ZM774.377 255.05H884.275V145.15H774.377V255.05ZM663.479 255.05H773.377V145.15H663.479V255.05ZM552.581 255.05H662.479V145.15H552.581V255.05ZM441.683 255.05H551.581V145.15H441.683V255.05ZM330.784 255.05H440.683V145.15H330.784V255.05ZM219.886 255.05H329.784V145.15H219.886V255.05ZM108.987 255.05H218.886V145.15H108.987V255.05ZM108.987 144.15H218.886V34.252H108.987V144.15ZM219.886 144.15H329.784V34.252H219.886V144.15ZM330.784 144.15H440.683V34.252H330.784V144.15ZM441.683 144.15H551.581V34.252H441.683V144.15ZM552.581 144.15H662.479V34.252H552.581V144.15ZM663.479 144.15H773.377V34.252H663.479V144.15ZM774.377 144.15H884.275V34.252H774.377V144.15Z"
          fill="url(#paint0_radial_1_158)"
        />
        <defs>
          <radialGradient
            id="paint0_radial_1_158"
            cx="0"
            cy="0"
            r="1"
            gradientUnits="userSpaceOnUse"
            gradientTransform="translate(496.029 537.014) rotate(90) scale(537.014 496.029)"
          >
            <stop stop-color="white" stop-opacity="0.24" />
            <stop offset="1" stop-color="white" stop-opacity="0" />
          </radialGradient>
        </defs>
      </svg>
            <svg
        width="833"
        height="1075"
        viewBox="0 0 833 1075"
        fill="none"
        xmlns="http://www.w3.org/2000/svg"
		  className='absolute top-199 left-115 -z-10 w-208.25 h-268.75 opacity-25'
      >
        <path
          d="M108.987 33.252H218.886V0H219.886V33.252H329.784V0H330.784V33.252H440.683V0H441.683V33.252H551.581V0H552.581V33.252H662.479V0.000976562H663.479V33.252H773.377V0H774.377V33.252H884.275V0H885.275V33.252H992.058V34.252H885.275V144.15H992.058V145.15H885.275V255.05H992.058V256.05H885.275V365.947H992.058V366.947H885.275V476.845H992.058V477.845H885.275V596.183H992.058V597.183H885.275V707.08H992.058V708.08H885.275V817.5H992V818.5H885.275V928.5H992V929.5H885.275V1039.78H992.058V1040.78H885.275V1074.03H884.275V1040.78H774.377V1074.03H773.377V1040.78H108.987V1074.03H107.987V1040.78H0V1039.78H107.987V708.08H0V707.08H107.987V597.183H0V596.183H107.987V477.845H0V476.845H107.987V366.947H0V365.947H107.987V256.05H0V255.05H107.987V145.15H0V144.15H107.987V34.252H0V33.252H107.987V0H108.987V33.252ZM108.987 1039.78H773.377V929.5H733V928.5H773.377V818.5H754V817.5H773.377V708.08H663.5V759H662.5V708.08H552.5V743H551.5V708.08H441.5V753H440.5V708.08H330.5V750H329.5V708.08H219.5V738H218.5V708.08H108.987V1039.78ZM774.377 1039.78H884.275V929.5H774.377V1039.78ZM774.5 850H774.377V928.5H884.275V818.5H774.5V850ZM774.5 817.5H884.275V708.08H774.5V817.5ZM108.987 707.08H218.5V597.183H108.987V707.08ZM219.5 707.08H329.5V597.183H219.5V707.08ZM330.5 707.08H440.5V597.183H330.5V707.08ZM441.5 707.08H551.5V597.183H441.5V707.08ZM552.5 707.08H662.5V597.183H552.5V707.08ZM663.5 707.08H773.377V597.183H663.5V707.08ZM774.5 707.08H884.275V597.183H774.5V707.08ZM108.987 596.183H218.5V550H219.5V596.183H329.5V550H330.5V596.183H440.5V550H441.5V596.183H551.5V550H552.5V596.183H662.5V551H663.5V596.183H773.377V562.931H773.5V550H774.5V596.183H884.275V477.845H774.377V549.67H773.377V477.845H663.479V548.465H662.479V477.845H552.581V549.67H551.581V477.845H441.683V549.67H440.683V477.845H330.784V549.67H329.784V477.845H219.886V549.67H218.886V477.845H108.987V596.183ZM108.987 476.845H218.886V366.947H108.987V476.845ZM219.886 476.845H329.784V366.947H219.886V476.845ZM330.784 476.845H440.683V366.947H330.784V476.845ZM441.683 476.845H551.581V366.947H441.683V476.845ZM552.581 476.845H662.479V366.947H552.581V476.845ZM663.479 476.845H773.377V366.947H663.479V476.845ZM774.377 476.845H884.275V366.947H774.377V476.845ZM108.987 365.947H218.886V256.05H108.987V365.947ZM219.886 365.947H329.784V256.05H219.886V365.947ZM330.784 365.947H440.683V256.05H330.784V365.947ZM441.683 365.947H551.581V256.05H441.683V365.947ZM552.581 365.947H662.479V256.05H552.581V365.947ZM663.479 365.947H773.377V256.05H663.479V365.947ZM774.377 365.947H884.275V256.05H774.377V365.947ZM774.377 255.05H884.275V145.15H774.377V255.05ZM663.479 255.05H773.377V145.15H663.479V255.05ZM552.581 255.05H662.479V145.15H552.581V255.05ZM441.683 255.05H551.581V145.15H441.683V255.05ZM330.784 255.05H440.683V145.15H330.784V255.05ZM219.886 255.05H329.784V145.15H219.886V255.05ZM108.987 255.05H218.886V145.15H108.987V255.05ZM108.987 144.15H218.886V34.252H108.987V144.15ZM219.886 144.15H329.784V34.252H219.886V144.15ZM330.784 144.15H440.683V34.252H330.784V144.15ZM441.683 144.15H551.581V34.252H441.683V144.15ZM552.581 144.15H662.479V34.252H552.581V144.15ZM663.479 144.15H773.377V34.252H663.479V144.15ZM774.377 144.15H884.275V34.252H774.377V144.15Z"
          fill="url(#paint0_radial_1_158)"
        />
        <defs>
          <radialGradient
            id="paint0_radial_1_158"
            cx="0"
            cy="0"
            r="1"
            gradientUnits="userSpaceOnUse"
            gradientTransform="translate(496.029 537.014) rotate(90) scale(537.014 496.029)"
          >
            <stop stop-color="white" stop-opacity="0.24" />
            <stop offset="1" stop-color="white" stop-opacity="0" />
          </radialGradient>
        </defs>
      </svg>
        </div>
    )
}